src/InformationRegisters/РегистрацияПрослеживаемыхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияПрослеживаемыхТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПрослеживаемости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>11</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРегистрацииПрослеживаемыхТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровНаСкладе</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/УведомлениеОбОстаткахПрослеживаемыхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>УведомлениеОбОстаткахПрослеживаемыхТоваров</Name>
			<BasedOn>
				<xr:Item>Document.УведомлениеОбОстаткахПрослеживаемыхТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрослеживаемыеТовары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РНПТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровНаСкладе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПрослеживаемости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорректировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУведомлениеОбОстатках</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбОстаткахПрослеживаемыхТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭДПослеИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2ПослеИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияПослеИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПрослеживаемостиПослеИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоПодтверждениеИзФНС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакУведомления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФормыРеорганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННДоРеорганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППДоРеорганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакУведомленияДоИзменения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПрослеживаемости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПослеИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПрослеживаемостиПослеИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПослеИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаПрослеживаемости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхожденияПослеИзменения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продавцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/РегистрацияПрослеживаемыхТоваров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет обновления регистра сведений регистрация прослеживаемых товаров
//
// Параметры:
// Регистратор - ДокументСсылка - Документ из которого вызывают процедуру
// ДокументОснования - ДокументСсылка -  Документ основания (первичный документ, по которому сформировано уведомление или не сформировано еще)
// УдалениеПроведения - Булево - флаг, показывающий, что процедуры вызывана при отмене проведения Регистратора
// 
Процедура ОбновитьСостояние(Регистратор, ДокументОснование, УдалениеПроведения = Ложь) Экспорт
	
	ПараметрыДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Дата, Организация");
	
	Если НеОбновлятьСостояние(ДокументОснование, ПараметрыДокументаОснования.Дата) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЗапроса = ПолучитьТаблицуДляОбновленияРегистрацииПрослеживаемогоТовара(
		Регистратор, ДокументОснование, УдалениеПроведения, ПараметрыДокументаОснования);
		
	Если ТаблицаЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Набор = РегистрыСведений.РегистрацияПрослеживаемыхТоваров.СоздатьНаборЗаписей();
	Набор.Отбор.Основание.Установить(ДокументОснование);
	
	Для каждого ТекущаяСтрока Из ТаблицаЗапроса Цикл
		
		Набор.Отбор.Организация.Установить(ТекущаяСтрока.Организация);
		Набор.Отбор.ВидОперации.Установить(ТекущаяСтрока.ВидОперации);
		
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ТекущаяСтрока);
	
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

// Процедура выполняет удаление записей в регистре при отмене первичного документа
//
// Параметры:
// 
// Регистратор - ДокументСсылка - Первичный документ, из которого вызывают процедуру
// 
Процедура ОбновитьСостояниеУдалениеПроведенияПервичногоДокумента(Регистратор) Экспорт
	
	ПараметрыДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Регистратор, "Дата, Организация");
	
	Если НеОбновлятьСостояние(Регистратор, ПараметрыДокументаОснования.Дата) Тогда
		Возврат;
	КонецЕсли;

	Набор = РегистрыСведений.РегистрацияПрослеживаемыхТоваров.СоздатьНаборЗаписей();
	Набор.Отбор.Основание.Установить(Регистратор);
	Набор.Отбор.Организация.Установить(ПараметрыДокументаОснования.Организация);
	
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет необходимость обновления регистра сведений Регистрация прослеживаемого товара
//
// Параметры:
// ДокументОснование - ДокументСсылка - Документ, по которому будет формироваться запись в регистре и расчет остатка 
// Период - Дата - Дата документа основания
// 
// Возвращаемое значение:
// Булево - Истина если не надо обновлять запись в регистре
//
Функция НеОбновлятьСостояние(ДокументОснование, Период) Экспорт
	
	Если Не ПрослеживаемостьБРУ.ВедетсяУчетПрослеживаемыхТоваров(Период) Тогда
		
		// Очистим регистр по основанию, если пользователь поменял дату документа основания 
		// и дата не попадает в период ведения прослеживаемости
		Набор = РегистрыСведений.РегистрацияПрослеживаемыхТоваров.СоздатьНаборЗаписей();
		Набор.Отбор.Основание.Установить(ДокументОснование);
		Набор.Записать(Истина);
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе") Тогда
		
		// Не обновляем состояния инвентаризаций товаров с датой больше разрешенной даты
		Возврат Период > ПрослеживаемостьБРУ.ДатаОкончанияРегистрацииУведомленийОбОСтатках();
			
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Считает количество товара по которому необходимо сделать запись в регистре Регистрация прослеживаемого товара
//
// Параметры:
// ДокументОснование - ДокументСсылка - Документ, по которому будет формироваться запись в регистре и расчет остатка 
// ПараметрыДокументаОснования - Структура - 
//												Дата - Дата - дата документа основания
//							 					Организация - СправочникСсылка.Организация - организация 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица готовых записей в регистр Регистрация прослеживаемого товара
//
Функция ПолучитьТаблицуДляОбновленияРегистрацииПрослеживаемогоТовара(ДокументРегистратор, ДокументОснование, УдалениеПроведения, ПараметрыДокументаОснования) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("Основание", ДокументОснование);
	Запрос.УстановитьПараметр("НачалоПериода", ПрослеживаемостьБРУ.ДатаНачалаУчетаПрослеживаемыхТоваров());
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыДокументаОснования.Дата);
	Запрос.УстановитьПараметр("ПустаяСсылкаРнпт", Справочники.НомераГТД.ПустаяСсылка());
	Запрос.УстановитьПараметр("Организация", ПараметрыДокументаОснования.Организация);
	Запрос.УстановитьПараметр("ДокументИсключение",
		?(УдалениеПроведения, ДокументРегистратор, Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров.ПустаяСсылка()));
	
	Запрос.Текст = ТекстЗапросаПоОснованию(ДокументОснование, ПараметрыДокументаОснования)
				+ ТекстЗапросаПоУведомлениямИВычислениюОстатка();
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ПодготовитьПараметрыТаблицыРегистрацииПрослеживаемыхТоваров(ТаблицаРеквизитов, ТаблицаТоваров)

	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.таблицаТоваров
	
	СписокОбязательныхКолонок = ""
		+ "Ссылка,"                                   // <ДокументСсылка.*> - документ-регистратор движений
		+ "НомерСтроки,"                              // <Число> - номер строки в таблице товаров
		+ "Номенклатура,"                             // <СправочникСсылка.Номенклатура> - номенклатура
		+ "Количество,"		                          // <Число ,15,3> - количество
		+ "КоличествоПрослеживаемости,"               // <Число, 15,3> - количество по прослеживаемости
		+ "Сумма,"		                              // <Число, 15,3> - сумма
		+ "СтранаПроисхождения";                      // <СправочникСсылка.СтраныМира> - страна происхождения товара
		
	Параметры.Вставить("ТаблицаТоваров", ПрослеживаемостьБП.ПолучитьТаблицуПараметровПроведения(
		ТаблицаТоваров, СписокОбязательныхКолонок));
		
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
		+ "Период,"							// <Дата> - период движений - дата документа
		+ "Регистратор,"					// <ДокументСсылка.*> - документ-регистратор движений
		+ "Организация,"					// <СправочникСсылка.Организации> - организация
		+ "РНПТ,"							// <ОпределяемыеТипы.РНПТ> - РНПТ
		+ "ЭтоКорректировочноеУведомление,"	// <Булево> - признак, показывающий, что данные их корректировочного документа
		+ "ПолученоПодтверждениеИзФНС,"		// <Булево> - признак, показывающий, что получено подтверждение от ФНС
		+ "Основание";						//<ДокументСсылка.*> - документ-основания
		
	Параметры.Вставить("Реквизиты", ПрослеживаемостьБП.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизитов, СписокОбязательныхКолонок));
		
	Возврат Параметры;

КонецФункции

Функция ТекстЗапросаПоОснованию(ДокументОснование, ПараметрыДокументаОснования)
	
	ОбъектМетаданных = ДокументОснование.Метаданные();
	
	ТекстЗапроса = Документы[ОбъектМетаданных.Имя].ТекстЗапросаТаблицаПрослеживаемыхТоваровПоОснованию();
	
	Возврат ТекстЗапроса + ПрослеживаемостьБП.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаПоУведомлениямИВычислениюОстатка()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УведомлениеОбОстаткахПрослеживаемыхТоваровТовары.Номенклатура КАК Номенклатура,
	|	СУММА(УведомлениеОбОстаткахПрослеживаемыхТоваровТовары.Количество) КАК Количество,
	|	СУММА(УведомлениеОбОстаткахПрослеживаемыхТоваровТовары.Сумма) КАК Сумма,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.КодТНВЭД КАК ТНВЭД,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.НомерКорректировки КАК НомерКорректировки,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка КАК СсылкаНаУведомление,
	|	СУММА(0) КАК КоличествоПрослеживаемости
	|ПОМЕСТИТЬ ВТ_ВыписанныеУведомления
	|ИЗ
	|	Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Товары КАК УведомлениеОбОстаткахПрослеживаемыхТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров КАК УведомлениеОбОстаткахПрослеживаемыхТоваров
	|		ПО УведомлениеОбОстаткахПрослеживаемыхТоваровТовары.Ссылка = УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка
	|ГДЕ
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.ПервичныйДокумент = &Основание
	|	И УведомлениеОбОстаткахПрослеживаемыхТоваров.Проведен
	|	И УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка <> &ДокументИсключение
	|	И УведомлениеОбОстаткахПрослеживаемыхТоваров.НомерКорректировки = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.КодТНВЭД,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваровТовары.Номенклатура,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.НомерКорректировки,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УведомлениеОВвозеПрослеживаемыхТоваровТовары.Номенклатура,
	|	СУММА(УведомлениеОВвозеПрослеживаемыхТоваровТовары.Количество),
	|	СУММА(УведомлениеОВвозеПрослеживаемыхТоваровТовары.Сумма),
	|	УведомлениеОВвозеПрослеживаемыхТоваров.КодТНВЭД,
	|	УведомлениеОВвозеПрослеживаемыхТоваров.НомерКорректировки,
	|	УведомлениеОВвозеПрослеживаемыхТоваров.Ссылка,
	|	УведомлениеОВвозеПрослеживаемыхТоваровТовары.КоличествоПрослеживаемости
	|ИЗ
	|	Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Товары КАК УведомлениеОВвозеПрослеживаемыхТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОВвозеПрослеживаемыхТоваров КАК УведомлениеОВвозеПрослеживаемыхТоваров
	|		ПО УведомлениеОВвозеПрослеживаемыхТоваровТовары.Ссылка = УведомлениеОВвозеПрослеживаемыхТоваров.Ссылка
	|ГДЕ
	|	УведомлениеОВвозеПрослеживаемыхТоваров.ПервичныйДокумент = &Основание
	|	И УведомлениеОВвозеПрослеживаемыхТоваров.Проведен
	|	И УведомлениеОВвозеПрослеживаемыхТоваров.Ссылка <> &ДокументИсключение
	|
	|СГРУППИРОВАТЬ ПО
	|	УведомлениеОВвозеПрослеживаемыхТоваровТовары.Номенклатура,
	|	УведомлениеОВвозеПрослеживаемыхТоваров.КодТНВЭД,
	|	УведомлениеОВвозеПрослеживаемыхТоваров.НомерКорректировки,
	|	УведомлениеОВвозеПрослеживаемыхТоваров.Ссылка,
	|	УведомлениеОВвозеПрослеживаемыхТоваровТовары.КоличествоПрослеживаемости
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УведомлениеОбОстаткахПрослеживаемыхТоваровТовары.Номенклатура,
	|	СУММА(УведомлениеОбОстаткахПрослеживаемыхТоваровТовары.КоличествоПослеИзменения),
	|	СУММА(УведомлениеОбОстаткахПрослеживаемыхТоваровТовары.СуммаПослеИзменения),
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.КодТНВЭДПослеИзменения,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.НомерКорректировки,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка,
	|	0
	|ИЗ
	|	Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Товары КАК УведомлениеОбОстаткахПрослеживаемыхТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров КАК УведомлениеОбОстаткахПрослеживаемыхТоваров
	|		ПО УведомлениеОбОстаткахПрослеживаемыхТоваровТовары.Ссылка = УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка
	|ГДЕ
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.ПервичныйДокумент = &Основание
	|	И УведомлениеОбОстаткахПрослеживаемыхТоваров.Проведен
	|	И УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка <> &ДокументИсключение
	|	И УведомлениеОбОстаткахПрослеживаемыхТоваров.НомерКорректировки > 0
	|	И УведомлениеОбОстаткахПрослеживаемыхТоваров.ПолученоПодтверждениеИзФНС
	|
	|СГРУППИРОВАТЬ ПО
	|	УведомлениеОбОстаткахПрослеживаемыхТоваровТовары.Номенклатура,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.КодТНВЭДПослеИзменения,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.НомерКорректировки,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваровПоОснованию.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваровПоОснованию.Количество КАК Количество,
	|	ТаблицаТоваровПоОснованию.Сумма КАК Сумма,
	|	ТаблицаТоваровПоОснованию.ТНВЭД КАК ТНВЭД,
	|	ТаблицаТоваровПоОснованию.Организация КАК Организация,
	|	ТаблицаТоваровПоОснованию.ВидОперации КАК ВидОперации,
	|	ТаблицаТоваровПоОснованию.ПериодСобытия КАК ПериодСобытия,
	|	ТаблицаТоваровПоОснованию.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаТоваровПоОснованию.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТоваровПоОснованию.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости
	|ПОМЕСТИТЬ ВТ_ТаблицаТоваровПоОснованию
	|ИЗ
	|	ВТ_ТоварыПоОснованию КАК ТаблицаТоваровПоОснованию
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВыписанныеУведомления.СсылкаНаУведомление) КАК СсылкаНаУведомление,
	|	МАКСИМУМ(ВТ_ВыписанныеУведомления.НомерКорректировки) КАК НомерКорректировки,
	|	ВЫБОР
	|		КОГДА ВТ_ВыписанныеУведомления.СсылкаНаУведомление.ДокументУведомлениеОбОстатках = ЗНАЧЕНИЕ(Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.ПустаяСсылка)
	|			ТОГДА ВТ_ВыписанныеУведомления.СсылкаНаУведомление
	|		ИНАЧЕ ВТ_ВыписанныеУведомления.СсылкаНаУведомление.ДокументУведомлениеОбОстатках
	|	КОНЕЦ КАК Основание
	|ПОМЕСТИТЬ ПоследниеУведомления
	|ИЗ
	|	ВТ_ВыписанныеУведомления КАК ВТ_ВыписанныеУведомления
	|ГДЕ
	|	ВТ_ВыписанныеУведомления.СсылкаНаУведомление ССЫЛКА Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ВТ_ВыписанныеУведомления.СсылкаНаУведомление.ДокументУведомлениеОбОстатках = ЗНАЧЕНИЕ(Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.ПустаяСсылка)
	|			ТОГДА ВТ_ВыписанныеУведомления.СсылкаНаУведомление
	|		ИНАЧЕ ВТ_ВыписанныеУведомления.СсылкаНаУведомление.ДокументУведомлениеОбОстатках
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВыписанныеУведомления.СсылкаНаУведомление),
	|	МАКСИМУМ(ВТ_ВыписанныеУведомления.НомерКорректировки),
	|	ВТ_ВыписанныеУведомления.СсылкаНаУведомление
	|ИЗ
	|	ВТ_ВыписанныеУведомления КАК ВТ_ВыписанныеУведомления
	|ГДЕ
	|	ВТ_ВыписанныеУведомления.СсылкаНаУведомление ССЫЛКА Документ.УведомлениеОВвозеПрослеживаемыхТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыписанныеУведомления.СсылкаНаУведомление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваровПоУведомлениям.Номенклатура КАК Номенклатура,
	|	СУММА(ТаблицаТоваровПоУведомлениям.Количество) КАК Количество,
	|	СУММА(ТаблицаТоваровПоУведомлениям.Сумма) КАК Сумма,
	|	ТаблицаТоваровПоУведомлениям.ТНВЭД КАК ТНВЭД,
	|	СУММА(ТаблицаТоваровПоУведомлениям.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости
	|ПОМЕСТИТЬ ВТ_ТаблицаТоваровПоУведомлениям
	|ИЗ
	|	ПоследниеУведомления КАК ПоследниеУведомления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыписанныеУведомления КАК ТаблицаТоваровПоУведомлениям
	|		ПО ПоследниеУведомления.СсылкаНаУведомление = ТаблицаТоваровПоУведомлениям.СсылкаНаУведомление
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваровПоУведомлениям.Номенклатура,
	|	ТаблицаТоваровПоУведомлениям.ТНВЭД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТНВЭД,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваровПоОснованию.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваровПоОснованию.Количество - ЕСТЬNULL(ТаблицаТоваровПоУведомлениям.Количество, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаТоваровПоОснованию.Количество - ЕСТЬNULL(ТаблицаТоваровПоУведомлениям.Количество, 0)
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваровПоОснованию.Количество - ЕСТЬNULL(ТаблицаТоваровПоУведомлениям.Количество, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаТоваровПоОснованию.Сумма - ЕСТЬNULL(ТаблицаТоваровПоУведомлениям.Сумма, 0)
	|	КОНЕЦ КАК Сумма,
	|	ТаблицаТоваровПоОснованию.ТНВЭД КАК ТНВЭД,
	|	ТаблицаТоваровПоОснованию.Организация КАК Организация,
	|	ТаблицаТоваровПоОснованию.ВидОперации КАК ВидОперации,
	|	&Основание КАК Основание,
	|	ТаблицаТоваровПоОснованию.ПериодСобытия КАК ПериодСобытия,
	|	ТаблицаТоваровПоОснованию.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаТоваровПоОснованию.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваровПоОснованию.КоличествоПрослеживаемости - ЕСТЬNULL(ТаблицаТоваровПоУведомлениям.КоличествоПрослеживаемости, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаТоваровПоОснованию.КоличествоПрослеживаемости - ЕСТЬNULL(ТаблицаТоваровПоУведомлениям.КоличествоПрослеживаемости, 0)
	|	КОНЕЦ КАК КоличествоПрослеживаемости
	|ИЗ
	|	ВТ_ТаблицаТоваровПоОснованию КАК ТаблицаТоваровПоОснованию
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаТоваровПоУведомлениям КАК ТаблицаТоваровПоУведомлениям
	|		ПО ТаблицаТоваровПоОснованию.ТНВЭД = ТаблицаТоваровПоУведомлениям.ТНВЭД
	|			И ТаблицаТоваровПоОснованию.Номенклатура = ТаблицаТоваровПоУведомлениям.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаТоваровТолькоОприходование.Номенклатура,
	|	ВТ_ТаблицаТоваровТолькоОприходование.Количество,
	|	ВТ_ТаблицаТоваровТолькоОприходование.Сумма,
	|	ВТ_ТаблицаТоваровТолькоОприходование.ТНВЭД,
	|	ВТ_ТаблицаТоваровТолькоОприходование.Организация,
	|	ВТ_ТаблицаТоваровТолькоОприходование.ВидОперации,
	|	&Основание,
	|	ВТ_ТаблицаТоваровТолькоОприходование.ПериодСобытия,
	|	NULL,
	|	NULL,
	|	0
	|ИЗ
	|	ВТ_ТаблицаТоваровРазмеченный КАК ВТ_ТаблицаТоваровТолькоОприходование
	|ГДЕ
	|	ВТ_ТаблицаТоваровТолькоОприходование.РанееРегистрировалсяВПрослеживаемости
	|	И ВТ_ТаблицаТоваровТолькоОприходование.Количество > ВТ_ТаблицаТоваровТолькоОприходование.КоличествоУчет";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
